app/controllers/authors_controller.rb

  def index
    if params[:author_id]
      @posts = Author.find(params[:author_id]).posts
    else
      @posts = Post.all
---
SELECT "authors".* FROM "authors"